name: "SharedWeightsNetwork" # 可以为双引号也可以为单引号
layer { 
  name: "data" 
  type: "DummyData" 
  dummy_data_param { 
    num: 5 
    channels: 2 
    height: 3 
    width: 4 
    data_filler { 
      type: "gaussian" 
      std: 0.01 
    } 
  } 
  top: "data" 
} 
layer { 
  name: "innerproduct1" 
  type: "InnerProduct" 
  inner_product_param { 
    num_output: 10 
    bias_term: false 
    weight_filler { 
      type: "gaussian" 
      std: 10 
    } 
  } 
  param { name: "sharedweights" } 
  bottom: "data" 
  top: "innerproduct1" 
} 
layer { 
  name: "innerproduct2" 
  type: "InnerProduct" 
  inner_product_param { 
    num_output: 10 
    bias_term: false 
    weight_filler { 
      type: "gaussian" 
      std: 10 
    } 
  } 
  param { name: "sharedweights" } 
  bottom: "data" 
  top: "innerproduct2" 
} 
layer { 
  name: "loss" 
  type: "EuclideanLoss" 
  bottom: "innerproduct1" 
  bottom: "innerproduct2" 
} 