name: "UnsharedWeightsNetwork" # 可以为双引号也可以为单引号
force_backward: true #
layer { 
  name: "data" 
  type: "DummyData" 
  dummy_data_param { 
    num: 5 
    channels: 2 
    height: 3 
    width: 4 
    data_filler { 
      type: "gaussian" 
      std: 0.01 
    } 
  } 
  top: "data" 
} 
layer { 
  name: "innerproduct1" 
  type: "InnerProduct" 
  inner_product_param { 
    num_output: 10 
    bias_term:  true #
    weight_filler { 
      type: "gaussian" 
      std: 10 
    } 
  } 
  param { 
    name: "unsharedweights1" 
    lr_mult:  1 #
  } 
  param { lr_mult:  2  } #
   bottom: "data" 
  top: "innerproduct1"
  #loss_weight:  0.5 #
} 
layer { 
  name: "innerproduct2" 
  type: "InnerProduct" 
  inner_product_param { 
    num_output: 10 
    bias_term: true #
    weight_filler { 
      type: "gaussian" 
      std: 10 
    } 
  } 
  param { 
    name: "unsharedweights2" 
    lr_mult: 1 #
  } 
  param { lr_mult:  2  } #
  bottom: "data" 
  top: "innerproduct2" 
}   
layer { 
  name: "loss" 
  type: "EuclideanLoss" 
  #loss_weight:  0.5  #
  bottom: "innerproduct1" 
  bottom: "innerproduct2" 
} 