name: "TinyTestNetwork" # 可以为双引号也可以为单引号
layer { 
  name: "data" 
  type: "DummyData" 
  dummy_data_param { 
    shape { 
      dim: 5 
      dim: 2 
      dim: 3 
      dim: 4 
    } 
    data_filler { 
      type: "gaussian" 
      std: 0.01 
    } 
    shape { 
      dim: 5 
    } 
    data_filler { 
      type: "constant" 
      value: 0 
    } 
  } 
  top: "data" 
  top: "label" 
} 
layer { 
  name: "innerproduct" 
  type: "InnerProduct" 
  inner_product_param { 
    num_output: 1000 
    weight_filler { 
      type: "gaussian" 
      std: 0.01 
    } 
    bias_filler { 
      type: "constant" 
      value: 0 
    } 
  } 
  param { 
    lr_mult: 1 
    decay_mult: 1 
  } 
  param { 
    lr_mult: 2 
    decay_mult: 0 
  } 
  bottom: "data" 
  top: "innerproduct" 
} 
layer { 
  name: "loss" 
  type: "SoftmaxWithLoss" 
  bottom: "innerproduct" 
  bottom: "label" 
  top: "top_loss" 
} 
